
{
    "form_name": "dilemma",
    "answers": 
        {
        
            "dilemma-0": "17",
            "dilemma-1": "false",
            "dilemma-2": "false",
            "gather-facts-1": "This kind of thing happens all the time in complex systems. That's why we have so many tests. What's unusual in this situation is how far along we are the process. Going forward we will have to think about testing that could be initiated sooner to detect this type of problem. That, I'm sure I could push for, and maybe that's enough?",
            "gather-facts-2": "Location unknown. There were several different work groups involved so it would be difficult and time consuming to trace it back. That time would be better spent fixing the bug.",
            "gather-facts-3": "I found out today, but the problem may have been months in the making. Again, I think this has revealed some deficiencies in our testing procedures.",
            "num_stakeholders": "8",
            "option-description-0": "My boss and many colleagues believe that the risk of this bug resulting in a catastrophic failure is so low that it is not likely to ever happen. I can just go along with them.",
            "option-description-1": "I can refuse to sign-off on the system which means my boss would, as he has before, fire me to go ahead. It would ease my professional conscience, but losing my job isn't going to result in a safe product.",
            "option-description-2": "There are two ways I can go outside to stop the project from going head with this bug. I can go to a government regulator, or I can go to the press. It's the only way to ensure safety.",
            "option-title-0": "Be loyal to my team",
            "option-title-1": "Refuse to sign-off",
            "option-title-2": "Blow the Whistle",
            "stakeholder-directly-0": "directly",
            "stakeholder-directly-1": "directly",
            "stakeholder-directly-2": "directly",
            "stakeholder-directly-3": "directly",
            "stakeholder-directly-4": "directly",
            "stakeholder-directly-5": "false",
            "stakeholder-directly-6": "false",
            "stakeholder-directly-7": "false",
            "stakeholder-indirectly-0": "false",
            "stakeholder-indirectly-1": "false",
            "stakeholder-indirectly-2": "false",
            "stakeholder-indirectly-3": "false",
            "stakeholder-indirectly-4": "false",
            "stakeholder-indirectly-5": "indirectly",
            "stakeholder-indirectly-6": "indirectly",
            "stakeholder-indirectly-7": "indirectly",
            "stakeholder-name-0": "Future Passengers",
            "stakeholder-name-1": "Me, an engineer",
            "stakeholder-name-2": "Other Engineers in my Department",
            "stakeholder-name-3": "Aerospace Company",
            "stakeholder-name-4": "Senior Management",
            "stakeholder-name-5": "Other Workers",
            "stakeholder-name-6": "Aerospace Industry",
            "stakeholder-name-7": "Society",
            "state-the-problem": "I am in engineer working on a safety critical project in the aerospace industry. Testing results have revealed a bug that could cause a catastrophic failure during flight which means everyone on that flight will die. However, it is highly unlikely that this bug will be triggered, it could never be triggered. It's impossible to know. On the one hand, I owe it to everyone who relies on our product for safe flights the safest product I can produce; on the other hand, fixing the bug will result in significant financial set backs for me, owning shares means I have a conflict of interest. My professional integrity is in conflict with my financial interests--which could impact my family and everyone that relies on me personally. I have always been loyal to my colleagues and the company, but demanding this bug fix could negatively impact everyone I know and work with, not to mention it could ruin my reputation. If I refuse to sign-off I could lose my job. If word gets out about what I did, it could be hard to find another one in this industry and my skills are not easily transferable.",
            "tentative-choice-0": "false",
            "tentative-choice-1": "false",
            "tentative-choice-2": "Blow the Whistle"
        }
    
}
